import whisper
import time
import torch

# Завантажуємо модель
model = whisper.load_model("turbo", device="cuda")
start = time.time()
# Використовуємо метод transcribe, вказуючи мову
result = model.transcribe("AUDIO2.m4a", language="uk")
print(torch.cuda.memory_allocated()) 
print(result["text"])
print(time.time()-start)


# print(torch.cuda.is_available())  # Перевіряє, чи доступний GPU
# print(torch.cuda.device_count())  # Кількість доступних GPU
# print(torch.cuda.get_device_name(0))  # Назва першого GPU

# tiny
#  Ще, що, що, кіпера красне, цього світі можна з творити? О чому хто пати на шею? Мо можна це 20 динерік, що не були призвенні до арстретського війська, або такі, що були коли свіни не відвійськового, або не товаєсть, ложби, всього один, два, чих трей.
# 1.973820447921753

# base
#  Що ще таке прекрасно, все в освіті можна створити? Хочу могло вступати лише юник віде. Могло чизавати один рік, чи не були призвені до арстрійського війська, або такі, щоб були коли звільнені від військового, ритової зложби, всього один, два, чи три.
# 3.5597481727600098

# small
#  Що ж таке прекрасне в цьому світі можна створити? Хоч могли б ступати лише юники, можливо чи за 21 рік, що не були призвені до австрійського війська, або такі, що були колись вінені від військового фронтової служби. Всього 1, 2 чи 3.
# 7.534647226333618

# turbo
#  Що ж таке прекрасне в цьому світі можна створити? Хоч могли б вступати лише юники, молодші за 21 рік, що не були призвані до австрійського війська, або такі, що були колись звільнені від військового фронтової служби. Всього один, два чи три.
# 20.573388814926147
